age = int(input('Введите Ваш возраст:\n>>> '))

# Если возраст меньше 18 лет
if age < 18:
    # Вывести на экран "Доступ запрещен"
    print('Доступ запрещен')
else:
    # Иначе вывести на экран "Доступ разрешен"
    print('Доступ разрешен')

print('---')
print('Какие-то действия')
print('Конец программы')