# Практическое задание №4:
# Давайте усложним предыдущее задание.
# Измените сущности, добавив новый параметр - armor = 1.2 (величина брони персонажа)
# Теперь надо добавить новую функцию, которая будет вычислять и возвращать полученный урон
# по формуле:

# damage = damage / armor

# Следовательно, у вас должно быть 2 функции:
# 1) Наносит урон. Это улучшенная версия функции из задачи 3.
# 2) Вычисляет урон по отношению к броне.

# Примечание: Функция номер 2 используется внутри функции номер 1 для вычисления урона
# вычитания его из здоровья персонажа.


